espressif/esp-pqc/examples/esp_hybrid_tls/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c5"

# PQC app + partition layout need >2 MB total flash (factory @ 0x20000, size 2 MB)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# TLS 1.3 + hybrid PQC
CONFIG_MBEDTLS_SSL_PROTO_TLS1_3=y
CONFIG_MBEDTLS_SSL_TLS1_3_KEY_EXCHANGE_GROUP_X25519MLKEM768=y
CONFIG_MBEDTLS_SSL_TLS1_3_SIG_MLDSA65=y

# PQC fork is PSA-only, disable legacy RSA/DS peripheral
CONFIG_ESP_TLS_USE_DS_PERIPHERAL=n

# liboqs
CONFIG_LIBOQS_ENABLED=y
CONFIG_LIBOQS_ENABLE_KEM_ML_KEM=y
CONFIG_LIBOQS_ENABLE_SIG_ML_DSA=y
CONFIG_LIBOQS_MINIMAL_COMMON=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=8192

# Custom partition table (2 MB app, PQC binary is large)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
